constant/momentumTransport.Smagorinsky
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType LES;

LES
{
    model    Smagorinsky;

    turbulence      on;
    printCoeffs     on;

    delta cubeRootVol;

    cubeRootVolCoeffs
    {
        deltaCoeff 1;
    }
}


// ************************************************************************* //
