0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    back
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }
    LF.plane.0
    {
        type            zeroGradient;
    }
    LF.plane.1
    {
        type            zeroGradient;
    }
    LF.plane.2
    {
        type            zeroGradient;
    }
    top
    {
        type            symmetryPlane;
    }
    before.stl
    {
        type            zeroGradient;
    }
    after.stl
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
