0_org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.24;

boundaryField
{
    inlet
    {
        type            mapped;
        field           epsilon;
        setAverage      0;
        average         0;
        interpolationScheme cellPointFace;
        value           uniform 0.24;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.24;
        value           uniform 0.24;
    }
    LF.plane.0
    {
        type            epsilonWallFunction;
        value           uniform 0.24;
    }
    LF.plane.1
    {
        type            epsilonWallFunction;
        value           uniform 0.24;
    }
    LF.plane.2
    {
        type            epsilonWallFunction;
        value           uniform 0.24;
    }
    top
    {
        type            symmetryPlane;
    }
    before.stl
    {
        type            epsilonWallFunction;
        value           uniform 0.24;
    }
    after.stl
    {
        type            epsilonWallFunction;
        value           uniform 0.24;
    }
    "(front|back)"
    {
        type            cyclicAMI;
    }
   /* "proc.*"
    {
        type            processor;
    }*/
}


// ************************************************************************* //
