0_org/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.05;

boundaryField
{
    inlet
    {
        type            mapped;
        field           nuTilda;
        setAverage      0;
        average         0;
        interpolationScheme cellPointFace;
        value           uniform 0.05;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.05;
        value           uniform 0.05;
    }
    LF.plane.0
    {
        type            fixedValue;
        value           uniform 0.05;
    }
    LF.plane.1
    {
        type            fixedValue;
        value           uniform 0.05;
    }
    LF.plane.2
    {
        type            fixedValue;
        value           uniform 0.05;
    }
    top
    {
        type            symmetryPlane;
    }
    before.stl
    {
        type            fixedValue;
        value           uniform 0.05;
    }
    after.stl
    {
        type            fixedValue;
        value           uniform 0.05;
    }
    "(front|back)"
    {
        type            cyclicAMI;
    }

   /* "proc.*"
    {
        type            processor;
    }*/
}


// ************************************************************************* //
