0_org/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    back
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    LF.plane.0
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    LF.plane.1
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    LF.plane.2
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    top
    {
        type            symmetryPlane;
    }
    before.stl
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    after.stl
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

   /* "proc.*"
    {
        type            processor;
    }*/
}


// ************************************************************************* //
