0_org/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.02449;

boundaryField
{
    front
    {
        type            cyclicAMI;
        value          $internalField;
    }
    back
    {
        type            cyclicAMI;
        value           $internalField;
    }
    inlet
    {
        type            mapped;
        field           omega;
        setAverage      0;
        average         0;
        interpolationScheme cellPointFace;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    LF.plane.0
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    LF.plane.1
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    LF.plane.2
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    top
    {
        type            symmetryPlane;
    }
    before.stl
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    after.stl
    {
        type            omegaWallFunction;
        value           $internalField;
    }

   /* "proc.*"
    {
        type            processor;
    }*/
}


// ************************************************************************* //
