Allrun
#!/bin/sh

cd "${0%/*}" || exit 1

. $WM_PROJECT_DIR/bin/tools/RunFunctions

./makeMesh

runParallel -append pimpleFoam

runApplication -append reconstructPar
